In [28]:
import pandas as pd
import numpy as np

# Get Datasets

## Patents

In [29]:
cities = pd.read_csv('Patents_Data/cities_with_scores.csv')

In [30]:
cities.head()

,Unnamed: 0,city_state,Year,Score1,Score2,Score5,Score6,Score7,City,State
0,0,New York_NY,1976,2.317268,2.718282,2.360150,2.718282,5.078432,New York,NY
1,1,Washington_DC,1976,1.558923,2.219101,1.738496,2.412346,4.150842,Washington,DC
2,2,Pittsburgh_PA,1976,2.718282,2.425776,2.564047,2.369092,4.933139,Pittsburgh,PA
3,3,Chicago_IL,1976,2.639930,2.393199,2.560876,2.358395,4.919271,Chicago,IL
4,4,Stamford_CT,1976,2.167678,2.186224,2.135113,2.301236,4.436350,Stamford,CT

In [31]:
cities.shape

(38573, 10)

In [32]:
cities_2007 = cities.loc[cities['Year']==2007]

In [33]:
cities_2007.shape

(976, 10)

In [34]:
cities_2007['city_state'] = cities_2007['city_state'].str.replace(' ','')
cities_2007['city_state'] = cities_2007['city_state'].str.replace(',','')
cities_2007['city_state'] = cities_2007['city_state'].str.replace('.','')

/usr/local/Anaconda3-5.0.0-Linux-x86_64/envs/PUI2016_Python3/lib/python3.5/site-packages/ipykernel/__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':
/usr/local/Anaconda3-5.0.0-Linux-x86_64/envs/PUI2016_Python3/lib/python3.5/site-packages/ipykernel/__main__.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  from ipykernel import kernelapp as app
/usr/local/Anaconda3-5.0.0-Linux-x86_64/envs/PUI2016_Python3/lib/python3.5/site-packages/ipykernel/__main__.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  app.launch_new_instance()

In [35]:
cities_2007['city_state'] = cities_2007['city_state'].str.lower()

/usr/local/Anaconda3-5.0.0-Linux-x86_64/envs/PUI2016_Python3/lib/python3.5/site-packages/ipykernel/__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

## SBIR

In [36]:
sbir = pd.read_csv('Regulation_Data/SBIR/clean_SBIR/clean_sbir_2007.csv')

In [37]:
sbir.head()

,Unnamed: 0,City_State,Award Mean,Award Sum,Company Count,City,State
0,0,abilene_tx,89662.000000,89662.0,1,Abilene,TX
1,6,acton_ma,110974.857143,776824.0,7,Acton,MA
2,36,agoura hills_ca,316646.666667,949940.0,3,Agoura hills,CA
3,45,akron_oh,265178.000000,530356.0,2,Akron,OH
4,84,alachua_fl,259361.666667,778085.0,3,Alachua,FL

In [38]:
sbir.shape

(813, 7)

In [39]:
sbir['City_State'] = sbir['City_State'].str.replace(' ','')
sbir['City_State'] = sbir['City_State'].str.replace(',','')
sbir['City_State'] = sbir['City_State'].str.replace('.','')

In [40]:
sbir['City_State'] = sbir['City_State'].str.lower()

## Econ

In [41]:
econ = pd.read_csv('econ_data/2007_creative_class.csv')

In [42]:
econ.head()

,Unnamed: 0,city_state,creative_employees,regular_employees,creative_establishments,regular_establishments
0,0,Abbeville _AL,0.0,0.0,0.0,0.0
1,1,Abbeville _GA,0.0,0.0,0.0,0.0
2,2,Abbeville _LA,700.0,9194.0,234.0,1420.0
3,3,Abbeville _SC,0.0,2512.0,0.0,352.0
4,4,Aberdeen Proving Ground _MD,0.0,33.0,10.0,120.0

In [43]:
econ['city_state'] = econ['city_state'].str.replace(' ','')

In [44]:
econ['city_state'] = econ['city_state'].str.replace('.','')
econ['city_state'] = econ['city_state'].str.replace(',','')

In [45]:
econ['city_state'] = econ['city_state'].str.lower()

In [46]:
econ['percent_creative_class'] = (econ['creative_employees']/(econ['creative_employees']+econ['regular_employees']))*100

In [47]:
econ.head()

,Unnamed: 0,city_state,creative_employees,regular_employees,creative_establishments,regular_establishments,percent_creative_class
0,0,abbeville_al,0.0,0.0,0.0,0.0,NaN
1,1,abbeville_ga,0.0,0.0,0.0,0.0,NaN
2,2,abbeville_la,700.0,9194.0,234.0,1420.0,7.074995
3,3,abbeville_sc,0.0,2512.0,0.0,352.0,0.000000
4,4,aberdeenprovingground_md,0.0,33.0,10.0,120.0,0.000000

## Demographics

# Begin Joins

In [48]:
#sbir with patents data
sbir_cities = cities_2007.merge(sbir, left_on = 'city_state', right_on = 'City_State', how = 'left')

In [49]:
sbir_creative_cities = sbir_cities.merge(econ,left_on = 'city_state', right_on = 'city_state', how = 'left')

In [50]:
sbir_creative_cities.columns

Index(['Unnamed: 0_x', 'city_state', 'Year', 'Score1', 'Score2', 'Score5',
       'Score6', 'Score7', 'City_x', 'State_x', 'Unnamed: 0_y', 'City_State',
       'Award Mean', 'Award Sum', 'Company Count', 'City_y', 'State_y',
       'Unnamed: 0', 'creative_employees', 'regular_employees',
       'creative_establishments', 'regular_establishments',
       'percent_creative_class'],
      dtype='object')

In [51]:
sbir_creative_cities[~sbir_creative_cities['creative_establishments'].isnull()].shape

(780, 23)

In [52]:
sbir_creative_cities.head()

,Unnamed: 0_x,city_state,Year,Score1,Score2,Score5,Score6,Score7,City_x,State_x,...,Award Sum,Company Count,City_y,State_y,Unnamed: 0,creative_employees,regular_employees,creative_establishments,regular_establishments,percent_creative_class
0,30784,armonk_ny,2007,1.725962,2.514172,1.444611,2.718282,4.162893,Armonk,NY,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,30785,santaclara_ca,2007,2.457342,2.613000,2.374604,2.542019,4.916622,Santa Clara,CA,...,10594411.0,30.0,Santa clara,CA,7963.0,21928.0,357887.0,1468.0,22886.0,5.773337
2,30786,houston_tx,2007,2.366360,2.518063,2.357407,2.533160,4.890567,Houston,TX,...,11744409.0,31.0,Houston,TX,4156.0,541333.0,5149469.0,26402.0,331584.0,9.512420
3,30787,sanjose_ca,2007,2.718282,2.718282,2.718282,2.525243,5.243525,San Jose,CA,...,2945508.0,11.0,San jose,CA,7912.0,130964.0,1541653.0,7521.0,104886.0,7.829886
4,30788,redmond_wa,2007,2.435712,2.549366,2.359712,2.445612,4.805324,Redmond,WA,...,1788239.0,7.0,Redmond,WA,7511.0,6483.0,131026.0,566.0,11545.0,4.714600

In [53]:
sbir_creative_cities.to_csv('sbir_creative_cities_2007.csv')